wallEVA96/STM32L071RBT6-HUHANG/Per_Driver/Inc/cfg_sys_clk.h
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CFG_SYS_CLK_H
#define __CFG_SYS_CLK_H

/* Includes ------------------------------------------------------------------*/
/* LL drivers common to all LL examples */
#include "stm32l0xx_ll_bus.h"
#include "stm32l0xx_ll_rcc.h"
#include "stm32l0xx_ll_system.h"
#include "stm32l0xx_ll_utils.h"
#include "stm32l0xx_ll_pwr.h"
#include "stm32l0xx_ll_exti.h"
#include "stm32l0xx_ll_gpio.h"
/* LL drivers specific to LL examples IPs */
#include "stm32l0xx_ll_adc.h"
#include "stm32l0xx_ll_comp.h"
#include "stm32l0xx_ll_cortex.h"
#include "stm32l0xx_ll_crc.h"
#include "stm32l0xx_ll_crs.h"
#include "stm32l0xx_ll_dac.h"
#include "stm32l0xx_ll_dma.h"
#include "stm32l0xx_ll_i2c.h"
#include "stm32l0xx_ll_iwdg.h"
#include "stm32l0xx_ll_lptim.h"
#include "stm32l0xx_ll_lpuart.h"
#include "stm32l0xx_ll_rng.h"
#include "stm32l0xx_ll_rtc.h"
#include "stm32l0xx_ll_spi.h"
#include "stm32l0xx_ll_tim.h"
#include "stm32l0xx_ll_usart.h"
#include "stm32l0xx_ll_wwdg.h"
#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

/* Exported Defines ------------------------------------------------------------*/

/**
  * @brief  Function called for achieving TX buffer sending
  * @param  None
  * @retval None
  */
#include"stdio.h" 
void SystemClock_Config(void);
void Configure_RTC(int wu_sec);
void Configure_RTC_Calendar(void);
void Configure_IWDG(int ww_sec);
void Check_IWDG_Reset(void);

#endif 
/************************ (C) COPYRIGHT walleva hu *****END OF FILE****/
